Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/SUI_НастройкиДокументовМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиДокументовМобильныхУстройств</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияДанныеЗаполнения = Тип("Структура") И Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ЗаполнитьВсемиПоУстановленномуОтбору();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВсемиПоУстановленномуОтбору()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МобильныеУстройства.Ссылка КАК МобильноеУстройство,
		|	НастройкиДокументов.Ссылка КАК НастройкаДокумента
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства,
		|	Справочник.SUI_НастройкиДокументов КАК НастройкиДокументов
		|ГДЕ
		|	НЕ МобильныеУстройства.ЭтотУзел
		|	И ВЫБОР
		|		КОГДА &МобильноеУстройство = НЕОПРЕДЕЛЕНО
		|		ИЛИ &МобильноеУстройство = ЗНАЧЕНИЕ(ПланОбмена.SUI_МобильныеУстройства.ПустаяСсылка)
		|			ТОГДА НЕ МобильныеУстройства.ПометкаУдаления
		|		ИНАЧЕ МобильныеУстройства.Ссылка = &МобильноеУстройство
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента = НЕОПРЕДЕЛЕНО
		|		ИЛИ &НастройкаДокумента = ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументов.ПустаяСсылка)
		|			ТОГДА НастройкиДокументов.Используется
		|			И НЕ НастройкиДокументов.ПометкаУдаления
		|		ИНАЧЕ НастройкиДокументов.Ссылка = &НастройкаДокумента
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", Отбор.МобильноеУстройство.Значение);
	Запрос.УстановитьПараметр("НастройкаДокумента", Отбор.НастройкаДокумента.Значение);
	
	Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
